{
  "2024-05-12_Audio_1312.m4a": {
    "raga": "Bhupali",
    "composition_type": "Taan",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio features Raga Bhupali, characterized by the pentatonic scale (Sa Re Ga Pa Dha). The performer begins with melodic phrases and transitions into singing Paltaas (melodic patterns) using Sargam notation set to a 16-beat rhythm cycle (Teentaal), marked by clapping.",
    "title": "Kaanha Karata Practices"
  },
  "2024-05-19_Audio_1258.m4a": {
    "raga": "Bhupali",
    "composition_type": "Taan",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio features rhythmic Sargam patterns using the notes Sa, Re, Ga, Pa, and Dha, which are the five notes of Raga Bhupali. These are structured as Paltaas (melodic permutations/practice exercises) performed at a brisk pace (Taan) over a 16-beat rhythmic cycle known as Teentaal.",
    "title": "Kaanha Karata Practices"
  },
  "2024-06-09_Audio_1025.m4a": {
    "raga": "Uncategorized",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Keherwa",
    "explanation": "The melody follows the pentatonic scale (Sa Re Ga Pa Dha) characteristic of Raga Bhupali. The performance features lyrics from the Rigveda ('Sangachadhvam'), classifying it as a Bandish. The rhythmic structure follows a steady 8-beat cycle, which is Keherwa taal.",
    "title": "Sam Gachadwam"
  },
  "2024-06-23_Audio_1152.m4a": {
    "raga": "Uncategorized",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Keherwa",
    "explanation": "The composition uses a pentatonic scale (Sa, Re, Ga, Pa, Dha) with all natural notes, which is the defining structure of Raga Bhupali. The presence of lyrics (a Vedic chant) classifies it as a Bandish/composition. The rhythm follows a steady 8-beat cycle characteristic of Keherwa Taal.",
    "title": "Sam Gachadwam"
  },
  "2024-10-13_Audio_1308.opus": {
    "raga": "Bhupali",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio features the notes Sa, Re, Ga, Pa, and Dha (pentatonic), which are characteristic of Raga Bhupali. It includes lyrics ('Kanha karat...') identifying it as a Bandish, followed by Sargam (note recitation), which indicates a practice or Paltaa-style exercise. The rhythm follows a standard 16-beat Teentaal cycle.",
    "title": "Kaanha Karata Practices"
  },
  "2024-10-23_Practice-Recording_1849.m4a": {
    "raga": "Bhupali",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio features the pentatonic scale of Raga Bhupali (S R G P D). It includes a Bandish (vocal composition with lyrics 'Kanha karat mujh sang barjori') accompanied by a 16-beat rhythm cycle (Teentaal). The second half of the clip focuses on structured fast Sargam sequences known as Paltaas.",
    "title": "Kaanha Karata"
  },
  "2024-12-08_Audio_1239.opus": {
    "raga": "Hamsadhwani",
    "composition_type": "Sargam",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The melody uses the notes Sa, Re, Ga, Pa, and Ni (all natural), which is the scale of Raga Hamsadhwani. The singer is reciting note names (Sargam) in a structured, repetitive rhythmic pattern over a 16-beat cycle, identifying it as a Sargam Paltaa (practice exercise) in Teentaal.",
    "title": "GaPa GaPa Practice"
  },
  "2024-06-09_Audio_0945.m4a": {
    "raga": "Bilawal",
    "composition_type": "Sargam",
    "paltaas": true,
    "taal": "Unknown",
    "explanation": "The audio features a vocalist singing individual notes slowly and sustainingly in ascending order (Sa, Re, Ga, Ma, Pa, Dha, Ni, Sa). All notes are *shuddh* (natural), which is characteristic of Raga Bilawal. This structured, note-by-note exposition is a form of *sargam* practice or *swar sadhana*, which can be classified as a basic *alaap* (slow, unmetered exploration of the raga's notes) and also as a fundamental *paltaa* (melodic exercise). There is no rhythmic accompaniment, hence the *taal* is unknown."
  },
  "2024-06-09_Audio_1005.m4a": {
    "raga": "Uncategorized",
    "composition_type": "Alaap",
    "paltaas": false,
    "taal": "Unknown",
    "explanation": "The audio features a slow, unmetered vocal improvisation (Alaap) exploring the melodic phrases of Raga Bhairavi. The prominent use of komal gandhar (flat G) and the overall contemplative mood are characteristic of Bhairavi. There is no rhythmic accompaniment (taal) and it is not a paltaa practice exercise."
  },
  "2024-09-08_Audio_1235.m4a": {
    "raga": "Bhupali",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio features a devotional song (bhajan) with clear lyrics, indicating it is a Bandish. The rhythm is clearly a 6-beat cycle, consistent with Dadra taal. At 0:35, the singer explicitly renders a sargam sequence ('Sa sa dha pa dha dha pa ga pa pa ga re ga re sa'), which constitutes a paltaa or sargam practice exercise. The raga uses predominantly Shuddha Swaras (natural notes) and has a light, devotional character, but does not present strong, definitive melodic phrases to identify it as a specific major Hindustani classical raga.",
    "title": "Kaanha Karata Practices"
  },
  "2024-10-06_Audio_1345.m4a": {
    "raga": "Bhupali",
    "composition_type": "Taan",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio begins with sargam (note names) patterns, characteristic of paltaas or melodic exercises, which transition into a bandish (song with lyrics) from 0:45. The melodic phrases, particularly the use of Komal Gandhar (Ga) and Komal Dhaivat (Dha) with Shuddh Rishabh (Re), and the overall free-flowing and devotional character, are highly indicative of Raga Pilu. The rhythmic cycle in the lyrical section clearly follows an 8-beat pattern, identifying it as Keherwa Taal.",
    "title": "Kaanha Karata Practices"
  },
  "2024-10-27_Audio_1305.m4a": {
    "raga": "Yaman",
    "composition_type": "Tarana",
    "paltaas": false,
    "taal": "Teentaal",
    "explanation": "The raga is identified as Bhairav due to the prominent use of komal Re (R flat) and komal Dha (D flat) and the characteristic melodic phrases. The composition type is Tarana, as it features rhythmic syllables (bols) like 'Dheem ta de ya na ta da re da ni' set to a fixed melodic and rhythmic structure, rather than traditional lyrics or a free alaap. It is not a paltaa/sargam practice as it's a structured composition. The tabla clearly maintains a 16-beat cycle, characteristic of Teentaal.",
    "title": "Dheem Ta Dhiyana"
  },
  "2024-11-03_Audio_1314.m4a": {
    "raga": "Khamaj",
    "composition_type": "Unknown",
    "paltaas": true,
    "taal": "Unknown",
    "explanation": "The melodic patterns feature *shuddha* Re, Ga, Ma, Pa, Dha, and utilize both *komal* Ni (e.g., in Ni Re, Ni Sa phrases) and *shuddha* Ni (e.g., in Sa Ni Dha Pa), which are characteristic of Raga Khamaj. The audio consists entirely of vocalized *sargam* (solfège) patterns, indicating a practice exercise rather than a full Alaap, Bandish, or Taan. There is no distinct percussive accompaniment or clear rhythmic cycle (taal) audible.",
    "title": "Vande Meenakshi -2"
  },
  "2024-11-17_Audio_1313.m4a": {
    "raga": "Khamaj",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The initial section (0:00-0:47) features sargam exercises (paltaas) clearly demonstrating the use of 'komal ni' (flat seventh) along with 'shuddha re', 'ga', 'ma', and 'pa'. This characteristic usage, especially the 'komal ni' with other shuddha swaras, strongly points to Raga Khamaj, which is also a common adaptation for the 'Vande Meenakshi' composition in Hindustani music. The lyrical composition 'Vande Meenakshi' begins around 0:48. Counting the phrases of the lyrical composition reveals a 16-beat rhythmic cycle, which corresponds to Teentaal.",
    "title": "Vande Meenakshi"
  },
  "2024-11-17_Audio_1313_2.m4a": {
    "raga": "Yaman",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Dadra",
    "explanation": "The audio features a lyrical composition (Bandish) that explicitly names the raga as 'Yaman' and its thhaat as 'Kalyan' within the lyrics ('Yaman sab Kalyan Thaath'). The melodic phrases clearly employ teevra Ma and other characteristic notes of Raga Yaman. It is not a Sargam/Paltaa practice as it involves singing full lyrics rather than note names. The rhythmic structure of the vocal line, with its gentle, cyclic flow, fits well with a 6-beat Dadra taal.",
    "title": "Prathama Prahara Practice"
  },
  "2024-12-08_Audio_1223.opus": {
    "raga": "Khamaj",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Keherwa - 8",
    "explanation": "The audio features a devotional song (Stuti/Bhajan) with clear lyrics, indicating a Bandish. The melodic framework primarily uses all Shuddha (natural) notes, which is characteristic of Raga Bilawal, often used for such serene compositions. There are no Sargam or Paltaa practice exercises. The rhythmic accompaniment clearly follows an 8-beat cycle, consistent with Keherwa Taal.",
    "title": "Vande Meenakshi -3"
  },
  "2024-12-08_Audio_1305.opus": {
    "raga": "Yaman",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Unknown",
    "explanation": "The audio explicitly mentions 'Yaman sab' and describes the raga's characteristics like 'Gandhar vadi' (G as dominant), 'Nishad sangat' (N as co-dominant), and 'Pratham prahar nishigat' (first quarter of the night), all of which align with Raga Yaman. The composition is a Lakshangeet, a type of Bandish (fixed composition with lyrics) that describes the features of a raga. It is not a Sargam/Paltaa practice as it uses descriptive lyrics rather than note sequences. No percussion is audible, making the specific 'Taal' difficult to identify, although the vocal delivery follows a metrical structure.",
    "title": "Prathama Prahara Practice"
  },
  "2024-12-15_Audio_1236.m4a": {
    "raga": "Bhupali",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio features a female vocalist singing sargam (solfège) syllables. The melodic framework primarily uses the notes Sa, Shuddha Re, Shuddha Ga, Shuddha Pa, and Komal Ni. There is no clear presence of Madhyam (Ma) or Dhaiwat (Dha) in the sung phrases. This specific pentatonic combination (S R G P N(k)) is not characteristic of a commonly known and named Hindustani classical raga, hence 'Unknown'. The composition type is clearly a 'Sargam' (solfège) practice exercise, which is also referred to as 'Paltaas' in Hindustani classical music, confirming `paltaas: true`. While the singing is rhythmic and follows a clear meter, a specific Hindustani classical taal (e.g., Teentaal, Rupak, Dadra) cannot be definitively identified from the vocal melody alone without accompanying percussion or explicit rhythmic patterns, hence 'Unknown' for taal.",
    "title": "Kaanha Karata - IAMV Holi Practice"
  },
  "2024-12-15_Audio_1309.m4a": {
    "raga": "Hamsadhwani",
    "composition_type": "Sargam",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio features a vocalist singing structured sargam (solfege) phrases repeatedly. These melodic patterns primarily use shuddha swaras (Sa, Re, Ga, Ma, Pa, Dha, Ni), which is characteristic of Raga Bilawal, often used as a foundational raga for such exercises. The repetitive, sequential nature of the sargam phrases confirms it as a 'Paltaa' or practice exercise, which falls under a type of 'Sargam Bandish'. The rhythm is clearly established by the tabla in a 16-beat cycle, identifying it as Teentaal.",
    "title": "GaPa GaPa  Practices"
  },
  "2024-12-29_Audio_1159.m4a": {
    "raga": "Hamsadhwani",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio features a vocal Sargam (note sequence) practice, which are known as Paltaas. The melodic framework uses Shuddh Sa, Re, Ga, Pa, and Ni, with the absence of Ma and Dha, which is characteristic of Raga Bhupali. The rhythm is clearly established by the tabla in a 16-beat cycle, identified as Teentaal. The structured and repetitive nature of the Sargam patterns within a fixed rhythm classifies it as a Bandish (specifically, a Sargam Bandish or exercise).",
    "title": "GaPa GaPa Practices"
  },
  "2025-01-15_Audio_2014.m4a": {
    "raga": "Hamsadhwani",
    "composition_type": "Sargam",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio begins with an 'Alaap' establishing the Raga Yaman, characterized by its use of Teevra Madhyam, Shuddh Re, Shuddh Ga, and Shuddh Ni. From 0:49 onwards, a rhythmic cycle begins, accompanying the singing of 'Sargam' (note names). These melodic exercises, often repetitive and structured, are known as 'Paltaas'. The underlying rhythm is clearly a 16-beat cycle, which is characteristic of 'Teentaal'.",
    "title": "Gapa Gapa Full Song"
  },
  "2025-01-26_Audio_1252.opus": {
    "raga": "Uncategorized",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Dadra",
    "explanation": "The audio features a devotional song (Bandish) with clear lyrics: 'तीरथ कौन करे हमारे'. The melodic phrases, characterized by the use of komal Re, komal Dha, and komal Ni, along with the overall melancholic and devotional mood, strongly indicate Raga Bhairavi. The accompanying percussion maintains a clear 6-beat rhythmic cycle, which is characteristic of Dadra Taal. This is a lyrical composition, not a practice exercise involving Paltaas.",
    "title": "Teeratha Kaun Kare"
  },
  "2025-02-23_Audio_1256.m4a": {
    "raga": "Uncategorized",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Dadra",
    "explanation": "The piece is a devotional song (Bandish) with fixed lyrics 'Man mein hi Ganga, man mein hi Jamuna...' It uses all Shuddh notes (Sa, Re, Ga, Ma, Pa, Dha, Ni) and has a simple, ascending-descending melodic structure, typical of Raga Bilawal or a folk tune based on it. The rhythmic accompaniment is a clear 6-beat cycle, characteristic of Dadra Taal. It is not a systematic exercise in Paltaas but a composed song.",
    "title": "Teeratha Kaun Kare"
  },
  "2025-03-12_Audio_1828.m4a": {
    "raga": "Unknown",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Dadra",
    "explanation": "The audio features a devotional song with clear lyrics ('Kaise Ban Ban Aaye', 'Dekho Dekho', 'Arey Dekho Holi Ke Khilaiya') and a fixed melodic structure, characteristic of a Bandish (or Bhajan). The rhythmic cycle is clearly a 6-beat pattern, identifying it as Dadra Taal. The composition is not a set of melodic exercises (paltaas). While a melodic framework is present, the specific raga is difficult to ascertain as the phrasing does not strictly adhere to the distinctive characteristics of a commonly recognized Hindustani classical raga, which is common in folk-influenced or devotional compositions."
  },
  "2025-05-11_Audio_1149.m4a": {
    "raga": "Yaman",
    "composition_type": "Unknown",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio features a Hindustani classical Tarana, which is a type of Bandish. The Raga is Hamsadhwani, identified by the use of all shuddha (natural) notes (Sa, Re, Ga, Ma, Pa, Dha, Ni) and characteristic melodic phrases, especially evident in the sargam sequence 'Sa ni ga pa ma ga re ga ma dha ni'. The composition is a Tarana due to the rhythmic syllables ('Dheem ta diye na', 'Tom tanana', 'Na dir dir tom') and its structure. The explicit recitation of a sargam phrase suggests the inclusion of paltaas for melodic practice. The rhythmic accompaniment is clearly identifiable as Teentaal, a 16-beat cycle.",
    "title": "Dheem Ta Dhiyana"
  },
  "2025-05-18_Audio_1158.opus": {
    "raga": "Yaman",
    "composition_type": "Unknown",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio features a Hindustani classical music exercise. The melodic phrases use Sargam (note names) and follow systematic patterns (paltaas). The scale primarily utilizes Shuddh Re, Ga, Ma, Dha, and Komal Ni, which are characteristic of Khamaj Thaat. The latter part of the audio includes rhythmic bols like 'dheem ta dhi ya na', indicating a structured composition. The rhythmic cycle, particularly noticeable in the bol section, is consistently 10 beats, identifying it as Jhaptaal.",
    "title": "Dheem Ta Dhiyana"
  },
  "2025-10-06_Audio_1943.opus": {
    "raga": "Uncategorized",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Unknown",
    "explanation": "The audio features a devotional song (Bandish) with clear lyrics. The melodic structure, particularly the use of komal (flat) 're', 'dha', and 'ni' notes, strongly suggests Raga Bhairavi. From 0:26, the singer transitions into a 'sargam' practice exercise ('Sa Re Sa Sa Dha Pa Ma Pa Dha Sa Sa Dha Pa Ma Ma Re Sa'), which is a form of paltaa. There is no discernible percussion instrument or a clearly defined rhythmic cycle (taal) throughout the audio, making the taal identification impossible.",
    "title": "Maata Bhavaani"
  },
  "2025-10-06_Audio_1943_2.opus": {
    "raga": "Kafi",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio begins with a devotional chant, followed by extensive Sargam exercises (Paltaas) in a Carnatic style. The main musical composition is a Carnatic kriti by Muthuswami Dikshitar, 'Vande Meenakshi Twam', which is typically set in Raga Shankarabharanam (equivalent to Bilawal Thaat in Hindustani music, featuring all Shuddha Swaras) and Adi Tala (an 8-beat cycle).",
    "title": "Mora Saiya Re"
  },
  "2025-10-26_Audio_1320.opus": {
    "raga": "Kafi",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio features a group singing a fixed composition with lyrics ('Mora Saiyaan Khelat Holi', 'Aangan mein Radha pyari'), indicating a Bandish. The rhythm is clearly a 6-beat cycle, characteristic of Dadra taal. At one point (around 1:13), specific sargam notes ('Sa Re Sa Sa Dha Pa') are sung as an exercise, confirming the presence of paltaas. The melodic structure is simple and devotional, primarily using shuddha swaras, but doesn't strongly establish a specific well-known classical raga beyond a general Bilawal-like scale, hence 'Unknown' for the precise raga name.",
    "title": "Mora Saiya Re"
  },
  "2025-11-02_Audio_1259.opus": {
    "raga": "Kafi",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Teentaal",
    "explanation": "The audio features a structured song (Bandish) with clear lyrics in Hindi, describing the festival of Holi ('khelat hori', 'bhar pichkari'). The melodic treatment, particularly the use of specific notes and phrases, aligns with Raga Kafi, which is commonly employed for Holi compositions and has a light, festive character. The rhythmic cycle consistently follows a 6-beat pattern, which is characteristic of Dadra Taal. It is not an exercise involving sargam or paltaas.",
    "title": "Mora Saiya Re"
  },
  "2025-11-16_Audio_1312.m4a": {
    "raga": "Kafi",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Teentaal",
    "explanation": "The audio features a traditional Bandish with clear lyrics, 'Bhar Pichkari mukh par mari'. This composition is characteristic of Raga Kafi, identified by its melodic movements and the typical use of Komal Gandhar (g) and Komal Nishad (n), along with Shuddha Re, Ma, Pa, Dha. The rhythmic accompaniment follows a clear 6-beat cycle, which is Dadra Taal. It is not a practice exercise (Paltaas) as it is a complete song with lyrical content.",
    "title": "Mora Saiya Re"
  },
  "2025-12-14_Audio_1317.m4a": {
    "raga": "Brindavani Sarang",
    "composition_type": "Sargam",
    "paltaas": false,
    "taal": "Teentaal",
    "explanation": "The raga 'Brindavani Sarang' is explicitly stated at the beginning of the audio. The piece begins with a slow melodic exposition (alaap/sargam), followed by a structured vocal composition with lyrics ('Bana bana dhundhan jaaun'), which is a Bandish. The initial portion is an alaap and not a repetitive paltaa exercise. The Bandish section has a clear rhythmic cycle of 6 beats, audibly marked by clapping, which corresponds to Dadra Taal.",
    "title": "Brindavani Sarang - Aaroh Avaroh"
  },
  "2025-12-14_Audio_1319.opus": {
    "raga": "Brindavani Sarang",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Teentaal",
    "explanation": "The audio features a devotional song (bhajan) with clear lyrics and a structured melodic framework, which falls under the 'Bandish' composition type. It is not a Paltaa practice exercise as it involves singing meaningful lyrics rather than sargam or structured swara patterns. The rhythmic accompaniment clearly follows a 6-beat cycle, characteristic of Dadra Taal. The specific raga, however, is difficult to ascertain definitively from this short excerpt due to the absence of prominent, distinct characteristic phrases or defining notes that clearly point to a particular raga.",
    "title": "Bana Bana Practice"
  },
  "2026-01-11_Audio_1316.m4a": {
    "raga": "Brindavani Sarang",
    "composition_type": "Alaap",
    "paltaas": false,
    "taal": "Unknown",
    "explanation": "The vocalist performs a slow, unmetered improvisation (Alaap) using 'Aa' syllables. The melodic framework uses all Shuddha (natural) notes (Sa, Re, Ga, Ma, Pa, Dha, Ni) in both ascent and descent, which is characteristic of Raga Bilawal. There is no rhythmic accompaniment, hence no identifiable taal, and the performance is a free exploration rather than a structured sargam/paltaa exercise.",
    "title": "Bana Bana Aalap"
  },
  "2026-01-13_Alaap_1210.opus": {
    "raga": "Brindavani Sarang",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Teentaal",
    "explanation": "The raga is identified as Bilawal due to the predominant use of all shuddh (natural) notes, giving it a bright and uplifting character often associated with morning ragas. The audio is a Bandish, a lyrical composition with a fixed melody, evident from the repeated verses 'वन वन ढूंढन जाऊं, किता हो छिप गए कृष्ण मुरारी' and 'शीश मुकुट और कानन कुंडल'. This is not a Paltaa exercise as it's a complete song rather than a repetitive melodic drill. The rhythm is in Dadra Taal, characterized by its 6-beat cycle, which is clearly audible and fits the lyrical structure of the devotional song.",
    "title": "Bana Bana KHMC"
  },
  "2026-01-13_Alaap_1212.m4a": {
    "raga": "Bhupali",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The raga features Shuddh Re, Ga, Pa, Dha and omits Ma and Ni, which is characteristic of Raga Bhupali. The audio begins with Alaap (Sargam and Aakar) and then transitions into a Bandish (song with lyrics) from around 1:11. The section from 2:11 onwards primarily consists of structured Sargam exercises, also known as Paltaas. The rhythm is a consistent 6-beat cycle, identifying it as Dadra Taal.",
    "title": "Kaanha Karata KHMC Full song"
  },
  "2026-02-01_Audio_1256.opus": {
    "raga": "Brindavani Sarang",
    "composition_type": "Taan",
    "paltaas": false,
    "taal": "Teentaal",
    "explanation": "The raga is identified as Brindavani Sarang due to the characteristic ascent (Sa Re Ma Pa Ni Sa) and descent (Ni Pa Ma Re Sa), the prominent use of Komal Re, Shuddh Ma, Pa, and Shuddh Ni, and the absence of Ga and Dha. The audio contains both sargam (note recitation) and meaningful lyrics ('Ban Ban dhundhan jaoon'), indicating a Bandish (composed song). The rhythm is a consistent 16-beat cycle, characteristic of Teentaal. While sargam is present, it is part of a song structure, not solely a standalone paltaa practice exercise.",
    "title": "Bana Bana - Taans"
  },
  "Drive_Brindavani-Sarang_Practice.m4a": {
    "raga": "Brindavani Sarang",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio begins with an unmetered alaap, setting the mood. This is followed by a bandish (a composed song with lyrics) starting around 0:36, which is set to Dadra taal (6 beats). The raga is Brindavani Sarang, characterized by the use of Shuddh Re, Shuddh Ma, Shuddh Pa, Shuddh Ni, with Ga and Dha typically omitted or used very sparingly. The later section (around 3:08) features clear sargam phrases, which are classic paltaas or practice exercises, confirming the raga's scale and structure.",
    "title": "Bana Bana - KHMC Full Song"
  },
  "Drive_Practice-Recording_1445.m4a": {
    "raga": "Bilahari Carnatic",
    "composition_type": "Unknown",
    "paltaas": true,
    "taal": "Unknown",
    "explanation": "The audio features singing of sargam (note names) exclusively using shuddh (natural) Re, Ga, Ma, Dha, Ni, which is characteristic of Raga Bilawal. The structured, repetitive patterns of note combinations clearly indicate that this is a sargam/paltaa practice exercise. There are no lyrics (not a Bandish), no sustained fast virtuosic runs (not a Taan), and it does not represent slow, free-form melodic improvisation (not a typical Alaap). There is no rhythmic accompaniment or discernible fixed rhythm cycle present, thus the taal is unknown.",
    "title": "Raara Venu Practice"
  },
  "Drive_Practice-Recording_1447.m4a": {
    "raga": "Bilahari Carnatic",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Adi Tala",
    "explanation": "The audio features Carnatic classical music, not Hindustani. The composition is a Kriti by Sri Muthiah Bhagavatar in Carnatic Raga Bhoopalam and Adi Tala. Since the request is for Hindustani classification, the specific raga and taal names are 'Unknown' as they are not standard Hindustani ragas or taals. 'Bandish' is used as a general term for a lyrical composition, analogous to a Kriti. The section from 1:06 onwards clearly includes singing of musical notes (sargam) and vocables as melodic exercises, which qualifies as 'paltaas'.",
    "title": "Raara Venu - Practice"
  },
  "Drive_Practice-Recording_1452.m4a": {
    "raga": "Bilahari Carnatic",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Adi Tala",
    "explanation": "The audio features a clear Sargam practice exercise in the initial part, which fits the description of 'Paltaas'. This is followed by a devotional song with lyrics, identifiable as a 'Bandish' (or Kriti in Carnatic music, given the pronunciation and lyrical content 'Rama Nagadhara'). The Raga is difficult to identify definitively as the Sargam appears to use a mix of 'shuddha Ma' (M1), 'tivra Ma' (M2), and 'komal Ni' (N2) notes that do not strictly conform to a single standard Hindustani or Carnatic raga. For instance, while 'Rama Nagadhara' is traditionally a Kriti in Shankarabharanam, the sung Sargam includes notes like 'prati Ma' (M2) and 'kaisiki Ni' (N2) which are not part of Shankarabharanam's scale. The Taal is not discernible as there is no percussion accompaniment or explicit rhythmic indication.",
    "title": "Raara Venu Practice 2"
  },
  "2025-01-08_Audio_1828.m4a": {
    "raga": "Hamsadhwani",
    "composition_type": "Sargam",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio features vocal sargam (note names) singing. The Raga is Bhupali, identified by the use of Shuddha Re, Ga, Pa, Dha, and the omission of Ma and Ni. The melodic phrases and characteristic movements are consistent with Bhupali. The composition type is a Bandish, specifically a Sargam Bandish, which is a structured composition sung with notes. It clearly consists of 'paltaas' (melodic exercises/runs) as the patterns are systematic, repetitive, and intended for practice. The rhythm is a consistent 16-beat cycle, characteristic of Teentaal, a very common rhythm for such compositions.",
    "title": "GaPa GaPa"
  },
  "2025-10-19_Audio_1235.m4a": {
    "raga": "Kafi",
    "composition_type": "Bandish",
    "paltaas": true,
    "taal": "Teentaal",
    "explanation": "The audio features a traditional Holi bandish, 'Mora Saiyan Re Khelat Hori', commonly set in Raga Kafi, although some improvisations might lean towards a lighter or folk style. The presence of lyrics makes it a Bandish. The vocalists are clearly practicing melodic phrases using sargam (note names like 'sa re sa dha pa' and 'pa dha sa') and echoing them, which are Paltaas. The tabla rhythm is a consistent 6-beat cycle, characteristic of Dadra taal.",
    "title": "Mora Saiya Re"
  },
  "2025-11-02_Audio_1255.opus": {
    "raga": "Kafi",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Teentaal",
    "explanation": "The audio features a female vocalist singing a Bandish (composed piece with lyrics) in Raga Kafi. The melody uses characteristic phrases of Kafi (including komal Ga and komal Ni) and the lyrics refer to Holi, a common theme for Kafi compositions. The rhythmic accompaniment is in Dadra Taal (6 beats). While a short sargam phrase appears initially, the primary content is a lyrical composition, not a paltaa practice.",
    "title": "Mora Saiya Re"
  },
  "Drive_Practice-Recording_1489.m4a": {
    "raga": "Yaman",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Unknown",
    "explanation": "The audio features Raga Yaman, explicitly mentioned in the lyrics ('Pratham Prahar Nisigaat Yaman Sab') and further confirmed by the phrase 'Gandhar Vadi Nishad Samgat' (Gandhar as Vadi, Nishad as Samvadi). The melodic structure prominently uses tivra Madhyam (sharp M) and characteristic phrases of Yaman. The composition is a Bandish (specifically a Lakshangeet, a type of bandish that describes the raga's characteristics) due to its structured lyrical content. It is not a Sargam/Paltaa practice exercise. The Taal is not clearly discernible as there is no prominent rhythmic accompaniment (e.g., tabla) establishing a clear rhythmic cycle.",
    "title": "Prathama Prahara"
  },
  "2026-02-15_Recording.webm": {
    "raga": "Bhimpalasi",
    "composition_type": "Sargam",
    "paltaas": false,
    "taal": "Keherwa - 8",
    "explanation": "Manually categorized"
  },
  "Drive_Bhoopali_Practice.m4a": {
    "raga": "Bhupali",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Teentaal",
    "explanation": "Manually categorized",
    "title": "Kaanha Karata - KHMC Full Song"
  },
  "Drive_Practice-Recording_1456.m4a": {
    "raga": "Bilahari Carnatic",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Adi Tala",
    "explanation": "Manually categorized",
    "title": "Raara Venu Full Song"
  },
  "2025-10-19_Audio_1229.m4a": {
    "raga": "Kafi",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Teentaal",
    "explanation": "Manually categorized",
    "title": "Mora Saiya Re"
  },
  "2025-10-26_Audio_1317.m4a": {
    "raga": "Kafi",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Teentaal",
    "explanation": "Manually categorized",
    "title": "Mora Saiya Re"
  },
  "2025-10-26_Audio_1323.opus": {
    "raga": "Kafi",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Teentaal",
    "explanation": "Manually categorized",
    "title": "Mora Saiya Re"
  },
  "2025-11-02_Audio_1256.opus": {
    "raga": "Kafi",
    "composition_type": "Bandish",
    "paltaas": false,
    "taal": "Teentaal",
    "explanation": "Manually categorized",
    "title": "Mora Saiya Re"
  }
}